opposed pre-mixed flame/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4000
(
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
...
)
;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform (0.8 0 0);
    }
    air
    {
        type            fixedValue;
        value           uniform (-0.8 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
200
(
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
(0.8 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
