opposed pre-mixed flame/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
);

regions
(
	boxToCell
	{
		box (0 -0.01 -0.01) (0.009 0.01 0.01);
		fieldValues
		(
			volScalarFieldValue T 305
			volVectorFieldValue	U (0.8 0 0)
		);
	}
	
	boxToCell
	{
		box (0.011 -0.01 -0.01) (0.02 0.01 0.01);
		fieldValues
		(
			volScalarFieldValue T 305
			volVectorFieldValue U (-0.8 0 0)
		);
	}
	
	boxToCell
	{
		box (0.009 -0.01 -0.01) (0.011 0.01 0.01);
		fieldValues
		(
			volScalarFieldValue T 1800
			volVectorFieldValue U (0 0 0)
		);
	}
);



// ************************************************************************* //
